kateloop/453-project/PIC18/code/main.c
    // Look at array containing LED Info and toggle LEDs accordingly

    // Octave 3
    if (conv_result.adc_channel == 2 && conv_result.result == 0x03) {
        // Octave 3 L & R LED on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (conv_result.adc_channel == 3 && conv_result.result == 0x04) {
        // Octave 3 L & R LED on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (conv_result.adc_channel == 4 && conv_result.result == 0x05) {
        // Octave 3 L & R LED on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001110;
    } else if (conv_result.adc_channel == 5 && conv_result.result == 0x06) {
        // Octave 3 L & R LED on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001101;
    } else if (conv_result.adc_channel == 6 && conv_result.result == 0x07) {
        // Octave 3 L & R LED on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b01100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (conv_result.adc_channel == 0 && conv_result.result == 0x01) {
        // Octave 3 L & R LED on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001011;
    } else if (conv_result.adc_channel == 1 && conv_result.result == 0x02) {
       // Octave 3 L & R LED on; B
       //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00000111;

    } else if (conv_result.adc_channel == 2 && conv_result.result == 0x0b) {
        // Octave 3 Right LED is on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b11000000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (conv_result.adc_channel == 3 && conv_result.result == 0x0c) {
        // Octave 3 Right LED is on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b11000000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (conv_result.adc_channel == 4 && conv_result.result == 0x0d) {
        // Octave 3 Right LED is on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11000000;
        //LATB   --NNPPPP
        LATC = 0b00001110;
    } else if (conv_result.adc_channel == 5 && conv_result.result == 0x16) {
        // Octave 3 Right LED is on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11000000;
        //LATB   --NNPPPP
        LATC = 0b00001101;

    } else if (conv_result.adc_channel == 6 && conv_result.result == 0x0f) {
        // Octave 3 Right LED is on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b01000000;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (conv_result.adc_channel == 0 && conv_result.result == 0x09) {
        // Octave 3 Right LED is on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11000000;
        //LATB   --NNPPPP
        LATC = 0b00001011;

    } else if (conv_result.adc_channel == 1 && conv_result.result == 0x0a) {
        // Octave 3 Right LED is on; B
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11000000;
        //LATB   --NNPPPP
        LATC = 0b00000111;

    } else if (conv_result.adc_channel == 2 && conv_result.result == 0x13) {
        // Octave 3 Left LED is on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b10100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (conv_result.adc_channel == 3 && conv_result.result == 0x14) {
        // Octave 3 Left LED is on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b10100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (conv_result.adc_channel == 4 && conv_result.result == 0x15) {
        // Octave 3 Left LED is on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10100000;
        //LATB   --NNPPPP
        LATC = 0b00001110;

    } else if (conv_result.adc_channel == 5 && conv_result.result == 0x0e) {
        // Octave 3 Left LED is on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10100000;
        //LATB   --NNPPPP
        LATC = 0b00001101;

    } else if (conv_result.adc_channel == 6 && conv_result.result == 0x17) {
        // Octave 3 Left LED is on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b00100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (conv_result.adc_channel == 0 && conv_result.result == 0x11) {
        // Octave 3 Left LED is on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10100000;
        //LATB   --NNPPPP
        LATC = 0b00001011;

    } else if (conv_result.adc_channel == 1 && conv_result.result == 0x12) {
        // Octave 3 Left LED is on; B
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10100000;
        //LATB   --NNPPPP
        LATC = 0b00000111;
    }

