kateloop/453-project/PIC18/code/main.c
    // Octave 4
    else if (conv_result.adc_channel == 2 && conv_result.result == 0x23) {
        // Octave 4 L & R LED on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b10001100;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (conv_result.adc_channel == 3 && conv_result.result == 0x24) {
        // Octave 4 L & R LED on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b10001100;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (conv_result.adc_channel == 4 && conv_result.result == 0x25) {
        // Octave 4 L & R LED on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10001100;
        //LATB   --NNPPPP
        LATC = 0b00001110;

    } else if (conv_result.adc_channel == 5 && conv_result.result == 0x26) {
        // Octave 4 L & R LED on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10001100;
        //LATB   --NNPPPP
        LATC = 0b00001101;
    } else if (conv_result.adc_channel == 6 && conv_result.result == 0x27) {
        // Octave 4 L & R LED on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b00001100;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (conv_result.adc_channel == 0 && conv_result.result == 0x21) {
        // Octave 4 L & R LED on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10001100;
        //LATB   --NNPPPP
        LATC = 0b00001011;
    } else if (conv_result.adc_channel == 1 && conv_result.result == 0x22) {
       // Octave 4 L & R LED on; B
       //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10001100;
        //LATB   --NNPPPP
        LATC = 0b00000111;
    } else if (conv_result.adc_channel == 2 && conv_result.result == 0x2b) {
        // Octave 4 Right LED is on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b10000100;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (conv_result.adc_channel == 3 && conv_result.result == 0x2c) {
        // Octave 4 Right LED is on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b10000100;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (conv_result.adc_channel == 4 && conv_result.result == 0x2d) {
        // Octave 4 Right LED is on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000100;
        //LATB   --NNPPPP
        LATC = 0b00001110;

    } else if (conv_result.adc_channel == 5 && conv_result.result == 0x2e) {
        // Octave 4 Right LED is on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000100;
        //LATB   --NNPPPP
        LATC = 0b00001101;

    } else if (conv_result.adc_channel == 6 && conv_result.result == 0x2f) {
        // Octave 4 Right LED is on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b00000100;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (conv_result.adc_channel == 0 && conv_result.result == 0x29) {
        // Octave 4 Right LED is on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000100;
        //LATB   --NNPPPP
        LATC = 0b00001011;

    } else if (conv_result.adc_channel == 1 && conv_result.result == 0x2a) {
        // Octave 4 Right LED is on; B
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000100;
        //LATB   --NNPPPP
        LATC = 0b00000111;

    } else if (conv_result.adc_channel == 2 && conv_result.result == 0x33) {
        // Octave 4 Left LED is on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b10001000;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (conv_result.adc_channel == 3 && conv_result.result == 0x34) {
        // Octave 4 Left LED is on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b10001000;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (conv_result.adc_channel == 4 && conv_result.result == 0x35) {
        // Octave 4 Left LED is on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10001000;
        //LATB   --NNPPPP
        LATC = 0b00001110;

    } else if (conv_result.adc_channel == 5 && conv_result.result == 0x36) {
        // Octave 4 Left LED is on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10001000;
        //LATB   --NNPPPP
        LATC = 0b00001101;

    } else if (conv_result.adc_channel == 6 && conv_result.result == 0x37) {
        // Octave 4 Left LED is on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b00001000;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (conv_result.adc_channel == 0 && conv_result.result == 0x31) {
        // Octave 4 Left LED is on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10001000;
        //LATB   --NNPPPP
        LATC = 0b00001011;

    } else if (conv_result.adc_channel == 1 && conv_result.result == 0x32) {
        // Octave 4 Left LED is on; B
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10001000;
        //LATB   --NNPPPP
        LATC = 0b00000111;
    }

    // Octave 5
    else if (conv_result.adc_channel == 2 && conv_result.result == 0x43) {
        // Octave 5 L & R LED on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00111111;

    } else if (conv_result.adc_channel == 3 && conv_result.result == 0x44) {
        // Octave 5 L & R LED on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00111111;

    } else if (conv_result.adc_channel == 4 && conv_result.result == 0x45) {
        // Octave 5 L & R LED on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00111110;

    } else if (conv_result.adc_channel == 5 && conv_result.result == 0x46) {
        // Octave 5 L & R LED on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00111101;
    } else if (conv_result.adc_channel == 6 && conv_result.result == 0x47) {
        // Octave 5 L & R LED on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b00000000;
        //LATB   --NNPPPP
        LATC = 0b00111111;
    } else if (conv_result.adc_channel == 0 && conv_result.result == 0x41) {
        // Octave 5 L & R LED on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00111011;
    } else if (conv_result.adc_channel == 1 && conv_result.result == 0x42) {
       // Octave 5 L & R LED on; B
       //LATA   -P-P----
       LATA = 0b11111111;
       //LATB   PNN-NN--
       LATB = 0b10000000;
       //LATB   --NNPPPP
       LATC = 0b00110111;

    } else if (conv_result.adc_channel == 2 && conv_result.result == 0x4b) {
        // Octave 5 Right LED is on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00011111;

    } else if (conv_result.adc_channel == 3 && conv_result.result == 0x4c) {
        // Octave 5 Right LED is on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00011111;

    } else if (conv_result.adc_channel == 4 && conv_result.result == 0x4d) {
        // Octave 5 Right LED is on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00011110;

    } else if (conv_result.adc_channel == 5 && conv_result.result == 0x4e) {
        // Octave 5 Right LED is on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00011101;

    } else if (conv_result.adc_channel == 6 && conv_result.result == 0x4f) {
        // Octave 5 Right LED is on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b00000000;
        //LATB   --NNPPPP
        LATC = 0b00011111;

    } else if (conv_result.adc_channel == 0 && conv_result.result == 0x49) {
        // Octave 5 Right LED is on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00011011;

    } else if (conv_result.adc_channel == 1 && conv_result.result == 0x4a) {
        // Octave 5 Right LED is on; B
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00010111;

    } else if (conv_result.adc_channel == 2 && conv_result.result == 0x53) {
        // Octave 5 Left LED is on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00101111;

    } else if (conv_result.adc_channel == 3 && conv_result.result == 0x54) {
        // Octave 5 Left LED is on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00101111;

    } else if (conv_result.adc_channel == 4 && conv_result.result == 0x55) {
        // Octave 5 Left LED is on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00101110;

    } else if (conv_result.adc_channel == 5 && conv_result.result == 0x56) {
        // Octave 5 Left LED is on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00101101;

    } else if (conv_result.adc_channel == 6 && conv_result.result == 0x57) {
        // Octave 5 Left LED is on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b00000000;
        //LATB   --NNPPPP
        LATC = 0b00101111;

    } else if (conv_result.adc_channel == 0 && conv_result.result == 0x51) {
        // Octave 5 Left LED is on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00101011;

    } else if (conv_result.adc_channel == 1 && conv_result.result == 0x52) {
        // Octave 5 Left LED is on; B
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000000;
        //LATB   --NNPPPP
        LATC = 0b00100111;
    }
}


void testToggle () {

