kateloop/453-project/PIC18/code/main.c
        }

    } else if (adc_num == ADCCHANE) {
        if (hResult == 0x00) {
            // no note playing
            new_note = 0x00;

        } else if (hResult == 0x01) {
            if (lResult >= 8 && lResult <= 69) {
                // 5EF
                new_note = 0x55;
            } else if (lResult >= 96 && lResult <= 210) {
                // 5E
                new_note = 0x45;
            } else if (lResult >= 214 && lResult <= 227) {
                // 5ES
                new_note = 0x4d;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 217 && lResult <= 255) {
                // 4EF
                new_note = 0x35;
            } else if (lResult >= 154 && lResult <= 202) {
                // 4E
                new_note = 0x25;
            } else if (lResult >= 115 && lResult <= 145) {
                // 4ES
                new_note = 0x2d;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 227 && lResult <= 240) {
                // 3EF
                new_note = 0x15;
            } else if (lResult >= 180 && lResult <= 210) {
                // 3E
                new_note = 0x05;
            } else if (lResult >= 90 && lResult <= 165) {
                // 3ES
                new_note = 0x0d;
            } else {
                // no note playing
                new_note = 0x00;
            }

        }

    } else if (adc_num == ADCCHANF) {
        if (hResult == 0x00) {
           // no note playing
            new_note = 0x00;

        } else if (hResult == 0x01) {
            if (lResult >= 148 && lResult <= 174) {
                // 5FF
                new_note = 0x56;
            } else if (lResult >= 89 && lResult <= 120) {
                // 5F
                new_note = 0x46;
            } else if (lResult >= 20 && lResult <= 72) {
                // 5FS
                new_note = 0x4e;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 223 && lResult <= 256) {
                // 4FF
                new_note = 0x36;
            } else if (lResult >= 165 && lResult <= 207) {
                // 4F
                new_note = 0x26;
            } else if (lResult >= 132 && lResult <= 160) {
                // 4FS
                new_note = 0x2e;
            } else {
               // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 148 && lResult <= 174) {
                // 3FF
                new_note = 0x16;
            } else if (lResult >= 89 && lResult <= 120) {
                // 3F
                new_note = 0x06;
            } else if (lResult >= 20 && lResult <= 72) {
                // 3FS
                new_note = 0x0e;
            } else {
                // no note playing
                new_note = 0x00;
            }
        }

    } else if (adc_num == ADCCHANG) {
        if (hResult == 0x00) {
           // no note playing
            new_note = 0x00;

        } else if (hResult == 0x01) {
            if (lResult >= 87 && lResult <= 160) {
                // 5GF
                new_note = 0x57;
            } else if (lResult >= 175 && lResult <= 215) {
                // 5G
                new_note = 0x47;
            } else if (lResult >= 224 && lResult <= 228) {
                // 5GS
                new_note = 0x4f;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 200 && lResult <= 229) {
                // 4GF
                new_note = 0x37;
            } else if (lResult >= 139 && lResult <= 192) {
                // 4G
                new_note = 0x27;
            } else if (lResult >= 107 && lResult <= 140) {
                // 4GS
                new_note = 0x2f;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 165 && lResult <= 190) {
                // 3GF
                new_note = 0x17;
            } else if (lResult >= 130 && lResult <= 160) {
                // 3G
                new_note = 0x07;
            } else if (lResult >= 107 && lResult <= 125) {
                // 3GS
                new_note = 0x0f;
            } else {
                // no note playing
                new_note = 0x00;
            }

        }

    }
    return new_note;
}